Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.GetAnalysisAreas Method
 Gets the analysis areas of the analysis part.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisObjectEnumerator GetAnalysisAreas()
Public Function GetAnalysisAreas As AnalysisObjectEnumerator
Return Value
Type: AnalysisObjectEnumerator
The analysis areas of the analysis part.
See Also
Reference
AnalysisPart Class
Tekla.Structures.Analysis Namespace